SQL Query for the first csv file - Table1.csv

In [45]:
import pandas as pd
import sqlite3

# Read the CSV file  
csv_file_path = r"C:\Users\amanp\OneDrive\Desktop\sister\csv files\Table1.csv"  # File path
df = pd.read_csv(csv_file_path, encoding='latin-1')

# Create an in-memory SQLite database and write the DataFrame to it
conn = sqlite3.connect(':memory:')  
df.to_sql('my_table', conn, index=False, if_exists='replace')

94

Query 1

In [46]:
query = "SELECT Name, Price FROM my_table"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

                                              Name   Price
0                            Grey Sneakers for Men  2995.0
1                   Black high-top boots for women  6995.0
2                     Olive/black sneakers for men  3795.0
3                         Sand Sports Shoe for men  7995.0
4                            Blue sneakers for men  6995.0
..                                             ...     ...
89                    ULTRA FLEX 3.0 - SMOOTH STEP  7999.0
90  Skechers Slip-ins: Ultra Flex 3.0 - Glitter Me  6999.0
91                                  AIR CUSHIONING  7999.0
92                                 UNO - EVERYWEAR  6999.0
93                   MAX CUSHIONING ARCH FIT -ENIG  9499.0

[94 rows x 2 columns]

Query 2

In [30]:
query = "SELECT Colours, Category FROM my_table"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

     Colours Category
0          2      Men
1          2    women
2          1    women
3          1      Men
4          1    women
..       ...      ...
130        2      Men
131        3      Men
132        2      Men
133        2    women
134        2      Men

[135 rows x 2 columns]

Query 3

In [11]:
query = "SELECT Price FROM my_table order by Price desc limit 1"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

     Price
0  19999.0

Query 4

In [42]:
query = "SELECT Name, Price FROM my_table where Category = 'women' and Price != 'None' order by Price limit 1"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

                                                Name   Price
0  Softride Enzo Evo Running ShoesPuma Black-CAST...  2496.6

Query 5

In [43]:
query = "SELECT Name, Price FROM my_table where Category = 'Men' and Price != 'None'"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

                                                 Name    Price
0    Skechers Slip-ins: Ultra Flex 3.0 - Brisk-Spec\n  4583.00
1       Skechers Slip-ins: Hypno-Flash 2.0 - Vexlux\n  4583.00
2   Skechers Slip-ins: Ultra Flex 3.0 - Smooth Step\n  4583.00
3                               Grey Sneakers for Men  2995.00
4                        Olive/black sneakers for men  3795.00
..                                                ...      ...
94   Pacer Future Men's SneakersPuma Black-Puma Black  3744.90
95  Vis2k 2000s Men's SneakersPUMA Navy-PUMA White...  2496.60
96   Suede Iconix 23 Men's SneakersPersian Blue-Amber  2912.70
97  ST Runner v3 L Men's SneakersPuma Black-Puma B...  2704.65
98  Tazon Advance Bold Men's SneakersPUMA Black-PU...  2704.65

[99 rows x 2 columns]

SQL Query for the first csv file - Table2.csv

In [16]:
import pandas as pd
import sqlite3

# Read the CSV file  
csv_file_path = r"C:\Users\amanp\OneDrive\Desktop\sister\csv files\Table2.csv"  # File path
df = pd.read_csv(csv_file_path, encoding='latin-1')

# Create an in-memory SQLite database and write the DataFrame to it
conn = sqlite3.connect(':memory:')  
df.to_sql('my_table', conn, index=False, if_exists='replace')

180

Query 1

In [2]:
query = "select StyleCode, CountOfSizes from my_table"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

         StyleCode  CountOfSizes
0    FGC0Z7045232A             3
1    FLC0260T0642A             0
2    FGC0Y9032092A             0
3    FGC0510S0052A             0
4    FGC0H40U8422A             1
..             ...           ...
175     177102-NVY             5
176     177102-ROS             4
177    177102-LTPK             2
178    220195-BKGY             1
179     220195-GRY             2

[180 rows x 2 columns]

Query 2

In [3]:
query = "select StyleCode, Colour from my_table"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

         StyleCode       Colour
0    FGC0Z7045232A         GREY
1    FLC0260T0642A        BLACK
2    FGC0Y9032092A  OLIVE_BLACK
3    FGC0510S0052A         SAND
4    FGC0H40U8422A         BLUE
..             ...          ...
175     177102-NVY         BLUE
176     177102-ROS    ROSE PINK
177    177102-LTPK         PINK
178    220195-BKGY        BLACK
179     220195-GRY         GREY

[180 rows x 2 columns]

Query 3 Method 1

In [4]:
query = "select distinct StyleCode from (select A.StyleCode, A.Colour, B.Colour from my_table A, my_table B where A.StyleCode = B.StyleCode and A.Colour != B.Colour) as F"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

  StyleCode
0   1917971
1   2027211
2   2058831
3   1987101
4   2027201
5   1826371
6   1826981
7   2044241
8   2044281

Query 3 Method 2

In [5]:
query = "select distinct A.StyleCode from my_table A, my_table B where A.StyleCode = B.StyleCode and A.Colour != B.Colour"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

  StyleCode
0   1917971
1   2027211
2   2058831
3   1987101
4   2027201
5   1826371
6   1826981
7   2044241
8   2044281

Query 4

In [6]:
query = "select StyleCode, Colour, CountOfSizes from my_table"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

         StyleCode       Colour  CountOfSizes
0    FGC0Z7045232A         GREY             3
1    FLC0260T0642A        BLACK             0
2    FGC0Y9032092A  OLIVE_BLACK             0
3    FGC0510S0052A         SAND             0
4    FGC0H40U8422A         BLUE             1
..             ...          ...           ...
175     177102-NVY         BLUE             5
176     177102-ROS    ROSE PINK             4
177    177102-LTPK         PINK             2
178    220195-BKGY        BLACK             1
179     220195-GRY         GREY             2

[180 rows x 3 columns]

Query 5

In [7]:
query = "select StyleCode, Colour from my_table where Colour = 'BLACK'"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

        StyleCode Colour
0   FLC0260T0642A  BLACK
1       377333_02  BLACK
2       384855_04  BLACK
3       384855_11  BLACK
4       377048_01  BLACK
5       380367_01  BLACK
6      DZ2628-102  BLACK
7      DM9537-001  BLACK
8      FB8875-001  BLACK
9      DA6364-001  BLACK
10     DZ7273-001  BLACK
11         EG4959  BLACK
12         B75807  BLACK
13         B75814  BLACK
14         GW3848  BLACK
15         FX3624  BLACK
16         FX3632  BLACK
17         GA0868  BLACK
18         CM4822  BLACK
19         GW8589  BLACK
20         GX6784  BLACK
21         GC0569  BLACK
22         HP7611  BLACK
23         IE6800  BLACK
24        1917971  BLACK
25        2027211  BLACK
26        2058831  BLACK
27        1987101  BLACK
28        2027201  BLACK
29        1826371  BLACK
30        1826981  BLACK
31        2044241  BLACK
32        2044281  BLACK
33    232451-BKRD  BLACK
34     232458-BBK  BLACK
35     149708-BKW  BLACK
36    149591-BKGD  BLACK
37    220195-BKGY  BLACK

SQL Query for the first csv file - Table3.csv

In [71]:
import pandas as pd
import sqlite3

# Read the CSV file  
csv_file_path = r"C:\Users\amanp\OneDrive\Desktop\sister\csv files\Table3.csv"  # File path
df = pd.read_csv(csv_file_path, encoding='latin-1')

# Create an in-memory SQLite database and write the DataFrame to it
conn = sqlite3.connect(':memory:')  
df.to_sql('my_table', conn, index=False, if_exists='replace')

81

Query 1

In [72]:
query = "select ID, Comfort from my_table" # while working with csv some characters automatically get generated in the first column of first row
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

    ID  Comfort
0    1      NaN
1    2      NaN
2    3      NaN
3    4      NaN
4    5      NaN
..  ..      ...
76  92      NaN
77  93      NaN
78  94      NaN
79  95      NaN
80  96      NaN

[81 rows x 2 columns]

Query 2

In [28]:
query = "select Rating from my_table where Rating>=4"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

    Rating
0      4.5
1      4.6
2      4.5
3      4.1
4      5.0
5      4.9
6      4.6
7      4.8
8      4.4
9      4.8
10     4.1
11     4.1
12     4.0
13     4.0
14     4.0
15     4.2
16     4.1
17     4.3
18     4.1
19     4.0
20     4.3
21     4.3
22     4.0
23     4.1
24     4.8
25     4.8
26     4.8
27     4.8
28     4.6
29     4.6
30     4.4
31     4.4
32     4.2
33     4.2
34     4.1
35     4.2
36     4.7
37     4.4
38     4.6
39     4.2
40     4.6
41     4.5
42     4.3
43     4.6
44     4.6
45     4.7
46     4.2
47     4.4
48     4.5
49     4.5
50     4.6
51     4.9
52     4.7
53     4.7
54     4.8
55     4.7
56     5.0
57     4.3
58     4.9

Query 3

In [29]:
query = "select Reviews from my_table"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

    Reviews
0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
..      ...
76   1235.0
77      3.0
78      1.0
79     40.0
80     41.0

[81 rows x 1 columns]

Query 4

In [30]:
# Quality = Performance and performance is quantifiied at a scale between 1 to 5
query = "select Performance from my_table where Performance>=3.5"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

    Performance
0           4.0
1           5.0
2           5.0
3           5.0
4           5.0
5           5.0
6           5.0
7           5.0
8           5.0
9           4.0
10          5.0
11          4.0
12          4.0
13          5.0
14          5.0
15          5.0
16          5.0
17          4.2
18          4.2
19          4.5
20          4.3
21          4.2
22          4.0
23          4.0
24          4.2
25          4.1
26          4.2
27          3.9
28          4.1
29          4.1
30          4.2
31          4.3
32          4.0
33          4.2
34          4.0
35          4.1
36          5.0
37          4.0
38          4.0
39          4.0
40          5.0
41          5.0
42          5.0
43          4.0
44          4.0

SQL Query for JOINS

In [75]:
import pandas as pd
import sqlite3

# Read the CSV file  
csv_file_path1 = r"C:\Users\amanp\OneDrive\Desktop\sister\csv files\Table1.csv"  # File path
df1 = pd.read_csv(csv_file_path1, encoding='latin-1')

csv_file_path2 = r"C:\Users\amanp\OneDrive\Desktop\sister\csv files\Table2.csv"  # File path
df2 = pd.read_csv(csv_file_path2, encoding='latin-1')

csv_file_path3 = r"C:\Users\amanp\OneDrive\Desktop\sister\csv files\Table3.csv"  # File path
df3 = pd.read_csv(csv_file_path3, encoding='latin-1')


# Create an in-memory SQLite database and write the DataFrame to it
conn = sqlite3.connect(':memory:')  
df1.to_sql('table1', conn, index=False, if_exists='replace')  
df2.to_sql('table2', conn, index=False, if_exists='replace')
df3.to_sql('table3', conn, index=False, if_exists='replace')

81

Query 1

In [76]:
# Different colours of same product have different sizes but same rating
query = "SELECT a.ID, Name, CountOfSizes, Rating FROM table1 a inner join table2 b on a.ID = b.ID inner join table3 c on b.ID = c.ID where c.rating = 5"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

   ID                           Name  CountOfSizes  Rating
0  52  Nike Air Trainer 1Men's shoes            13     5.0
1  94                 AIR CUSHIONING             0     5.0
2  94                 AIR CUSHIONING             2     5.0
3  94                 AIR CUSHIONING             5     5.0

Query 2

In [77]:
query = "select a.Category, avg(b.comfort) as 'Comfort Rating' from table1 a inner join table3 b on a.ID = b.ID group by a.category"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

  category  Comfort Rating
0      MEN        3.889474
1    WOMEN        3.920000

Query 3

In [78]:
query = "select name, performance from table1 a inner join table3 b on a.ID = b.ID where performance >= (select avg(performance) from table3) order by performance"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

                                                 Name  Performance
0                                      Samba OG Shoes          4.5
1                           Nike Air Max 1Men's shoes          5.0
2              Nike Blazer Low '77 VintageMen's Shoes          5.0
3   PUMA x LAMELO BALL MB.03 Toxic Men's Basketbal...          5.0
4   Viz Runner Repeat Men's Running SneakersPuma B...          5.0
5   Viz Runner Repeat Wide Men's Running ShoesPuma...          5.0
6   PUMA Serve Pro Men's SneakersPuma Black-Puma B...          5.0
7   Astro Kick SL Men's SneakersPuma White-Puma Te...          5.0
8   Star Vital Women's Training ShoesPUMA Black-PU...          5.0
9   ST Runner v3 L Men's SneakersPuma White-Puma W...          5.0
10  Softride Enzo Evo Running ShoesPuma Black-CAST...          5.0
11  Redon Bungee ShoesPuma Black-Puma White-High R...          5.0
12  Star Vital Women's Training ShoesPuma Black-Ro...          5.0
13   Pacer Future Men's SneakersPuma Black-Puma Black          5.0
14  Women's Slopeside Villageâ¢ Omni-Heatâ¢ Mid ...          5.0
15             Women's Facetâ¢ 75 Mid OutDryâ¢ Shoe          5.0
16                      Menâs Fairbanksâ¢ Low Shoe          5.0
17                      Men's Firecampâ¢ Remesh Shoe          5.0

Query 4

In [79]:
query = "select name, comfort from table1 a inner join table3 b on a.ID = b.ID where comfort >= (select avg(comfort) from table3) order by comfort"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

                                                 Name  Comfort
0                                  Ultimashow Shoes\n      3.9
1                                   WIND RAISER SHOES      3.9
2                                     SUPERSTAR SHOES      4.0
3                                     SUPERSTAR SHOES      4.0
4                                      Samba OG Shoes      4.0
5                                    Ultraboost Light      4.0
6                          FLUIDFLOW 2.0 RUNNING SHOE      4.0
7                                Ultraboost 1.0 Shoes      4.0
8                                 HYPERON 1.0 SHOES\n      4.0
9               Grand Court Cloudfoam Comfort Shoes\n      4.0
10                                 Pureboost 22 Shoes      4.0
11                                  SHEENWALK SHOES\n      4.0
12                                 SOLARGLIDE 6 Shoes      4.0
13  Women's Slopeside Villageâ¢ Omni-Heatâ¢ Mid ...      4.0
14             Men's Facetâ¢ 75 Alpha OutDryâ¢ Shoe      4.0
15         Men's Trailstormâ¢ Ascend Waterproof Shoe      4.0
16                                     Samba OG Shoes      4.1
17                                     Galaxy 6 Shoes      4.1
18     Lite Racer Adapt 4.0 Cloudfoam Slip-On Shoes\n      4.1
19             Women's Facetâ¢ 75 Mid OutDryâ¢ Shoe      4.2
20                               Women's Flow Fremont      5.0
21                      Menâs Fairbanksâ¢ Low Shoe      5.0

Query 5

In [82]:
df3

    ï»¿Waste Column  ID  Reviews  Comfort  Performance  Rating
0               NaN   1      NaN      NaN          NaN     NaN
1               NaN   2      NaN      NaN          NaN     NaN
2               NaN   3      NaN      NaN          NaN     NaN
3               NaN   4      NaN      NaN          NaN     NaN
4               NaN   5      NaN      NaN          NaN     NaN
..              ...  ..      ...      ...          ...     ...
76              NaN  92   1235.0      NaN          NaN     4.8
77              NaN  93      3.0      NaN          NaN     4.7
78              NaN  94      1.0      NaN          NaN     5.0
79              NaN  95     40.0      NaN          NaN     4.3
80              NaN  96     41.0      NaN          NaN     4.9

[81 rows x 6 columns]

In [85]:
query = "select StyleCode, Name, Price, Category, CountOfSizes, NumberOfColours from table1 a inner join table2 b on a.ID = b.ID"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

         StyleCode                            Name   Price category  \
0    FGC0Z7045232A           Grey Sneakers for Men  2995.0      MEN
1    FLC0260T0642A  Black high-top boots for women  6995.0    WOMEN
2    FGC0Y9032092A    Olive/black sneakers for men  3795.0      MEN
3    FGC0510S0052A        Sand Sports Shoe for men  7995.0      MEN
4    FGC0H40U8422A           Blue sneakers for men  6995.0      MEN
..             ...                             ...     ...      ...
175    177102-LTPK                 UNO - EVERYWEAR  6999.0    WOMEN
176     177102-ROS                 UNO - EVERYWEAR  6999.0    WOMEN
177     177102-NVY                 UNO - EVERYWEAR  6999.0    WOMEN
178    220195-BKGY   MAX CUSHIONING ARCH FIT -ENIG  9499.0      MEN
179     220195-GRY   MAX CUSHIONING ARCH FIT -ENIG  9499.0      MEN

     CountOfSizes  NumberOfColours
0               3                1
1               0                1
2               0                1
3               0                1
4               1                1
..            ...              ...
175             2                3
176             4                3
177             5                3
178             1                2
179             2                2

[180 rows x 6 columns]

Query 6

In [86]:
query = "select p.Name, p.rating, c.CountOfSizes as 'Respective Sizes' from (select b.ID, name, rating from table1 a inner join table3 b on a.ID = b.ID where rating >= (select avg(rating) from table3) order by rating) p inner join table2 c on p.ID =  c.ID"
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

                             name  rating  Respective Sizes
0      Nike Dunk LowWomen's Shoes     4.5                11
1     Nike Air Max 1Women's shoes     4.6                 1
2     Nike Air Max 1Women's shoes     4.6                 9
3     Nike Air Max 1Women's shoes     4.6                10
4     Nike Air Max 1Women's shoes     4.6                10
..                            ...     ...               ...
92                 AIR CUSHIONING     5.0                 0
93                 AIR CUSHIONING     5.0                 2
94                 AIR CUSHIONING     5.0                 5
95  MAX CUSHIONING ARCH FIT -ENIG     4.9                 1
96  MAX CUSHIONING ARCH FIT -ENIG     4.9                 2

[97 rows x 3 columns]